brew "act"
brew "agg"
brew "ansible"
brew "asciinema"
brew "awscli"
brew "bat"
brew "derailed/k9s/k9s"
brew "dive"
brew "doctl"
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-sizer"
brew "go"
brew "gradle"
brew "helm"
brew "htop"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "kubeshark"
brew "mas"
brew "minikube"
brew "neovim"
brew "npm"
brew "nvm"
brew "openjdk@17"
brew "poetry"
brew "syncthing", restart_service: true
brew "telnet"
brew "terraform"
brew "tldr"
brew "tmux"
brew "trivy"
brew "virtualenv"
brew "watch"
# Pulumi
tap "pulumi/tap"
brew "pulumi/tap/pulumi"
# Pulumi end

# Garden CLI Start
tap "garden-io/garden"
brew "garden-cli"
# Garden CLI End

# Brew dependencies
brew "python-setuptools"
brew "glib"
brew "sqlite"
brew "c-ares"
brew "openjdk"
brew "luajit"
brew "jpeg-turbo"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "beeper"
cask "bruno"
cask "chatgpt"
cask "discord"
cask "docker"
cask "elgato-control-center"
cask "espanso"
cask "firefox"
cask "font-monaspace"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hiddenbar"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "linear-linear"
cask "logitech-camera-settings"
cask "mullvad-browser"
cask "notion"
cask "obs"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "steam"
cask "tailscale"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zoom"


mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "ColorSlurp", id: 1287239339
mas "Dark Reader for Safari", id: 1438243180
mas "Dashlane", id: 517914548
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "reeder 5", id: 1529448980
